---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateThis
source: html/8116ccab-20e9-0d8d-836e-4aee76f07d25.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateThis Property

Can't create [Element].

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateThis { get; }
```